windAroundBuildings_CFDHAM_veg/0/air.bckp/LAD
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      LAD;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    west
    {
        type            fixedValue;
        value           uniform 0;
    }
    east
    {
        type            fixedValue;
        value           uniform 0;
    }
    north
    {
        type            slip;
    }
    south
    {
        type            slip;
    }
    ground
    {
        type            fixedValue;
        value           uniform 0;
    }
    top
    {
        type            slip;
    }
    buildings
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
