windAroundBuildings_CFDHAM_veg/0/air/Tambient
(
(	0	297.71	)
(	3600	297.21	)
(	7200	297.15	)
(	10800	297.15	)
(	14400	297.32	)
(	18000	297.09	)
(	21600	297.59	)
(	25200	298.93	)
(	28800	299.65	)
(	32400	300.15	)
(	36000	300.87	)
(	39600	301.37	)
(	43200	302.32	)
(	46800	300.93	)
(	50400	303.37	)
(	54000	303.65	)
(	57600	302.98	)
(	61200	301.65	)
(	64800	300.32	)
(	68400	299.37	)
(	72000	298.93	)
(	75600	298.65	)
(	79200	298.32	)
(	82800	297.98	)
(	86400	297.81	)
); 
