windAroundBuildings_CFDHAM_veg/0/air/cloudCover
(			
(	0	0.8	)
(	3600	0.8	)
(	7200	0.3	)
(	10800	0.1	)
(	14400	0.1	)
(	18000	0.1	)
(	21600	0.1	)
(	25200	0.1	)
(	28800	0.3	)
(	32400	0.3	)
(	36000	0.3	)
(	39600	0.3	)
(	43200	0.3	)
(	46800	0.3	)
(	50400	0.3	)
(	54000	0.3	)
(	57600	0.3	)
(	61200	0.0	)
(	64800	0.0	)
(	68400	0.0	)
(	72000	0.3	)
(	75600	0.1	)
(	79200	0.3	)
(	82800	0.8	)
(	86400	0.8	)
)			

