windAroundBuildings_CFDHAM_veg/0/air/w
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      w;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0076; 

boundaryField
{
    west
    {
        type            inletOutlet;
        inletValue      uniform 0.0076;
        value           uniform 0.0076;
    }
    east
    {
        type            uniformFixedValue;
        uniformValue    tableFile;
        uniformValueCoeffs
        {
            file        "$FOAM_CASE/0/air/wambient";
        }
        value           uniform 0.0076;
    }
    top
    {
        type            slip;
    }
    ground
    {
        type            zeroGradient;
    }
    north
    {
        type            slip;
    }
    south
    {
        type            slip;
    }
    buildings
    {
        type            compressible::CFDHAMfluidMoistureCoupledImpermeable;
        value           uniform 0.0076;
    }
}


// ************************************************************************* //
