windAroundBuildings_CFDHAM_veg/0/air/wambient
(			
(	0	0.0177	)
(	3600	0.0176	)
(	7200	0.0176	)
(	10800	0.0176	)
(	14400	0.0175	)
(	18000	0.0169	)
(	21600	0.0172	)
(	25200	0.0172	)
(	28800	0.017	)
(	32400	0.0171	)
(	36000	0.0169	)
(	39600	0.0172	)
(	43200	0.0174	)
(	46800	0.0177	)
(	50400	0.0171	)
(	54000	0.0165	)
(	57600	0.0172	)
(	61200	0.0172	)
(	64800	0.0175	)
(	68400	0.0172	)
(	72000	0.0172	)
(	75600	0.0171	)
(	79200	0.0167	)
(	82800	0.0166	)
(	86400	0.0165	)

); 			
