windAroundBuildings_CFDHAM_veg/0/vegetation.bckp/qs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      qs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    west
    {
        type            solarLoadRadiationViewFactor;
        albedoMode      lookup;
        albedo          uniform 0;
        qso             uniform 0;
        value           uniform 0;
    }
    east
    {
        type            solarLoadRadiationViewFactor;
        albedoMode      lookup;
        albedo          uniform 0;
        qso             uniform 0;
        value           uniform 0;
    }
    top
    {
        type            solarLoadRadiationViewFactor;
        albedoMode      lookup;
        albedo          uniform 0;
        qso             uniform 0;
        value           uniform 0;
    }
    ground
    {
        type            solarLoadRadiationViewFactor;
        albedoMode      lookup;
        albedo          uniform 0.2;
        qso             uniform 0;
        value           uniform 0;
    }
    north
    {
        type            solarLoadRadiationViewFactor;
        albedoMode      lookup;
        albedo          uniform 0;
        qso             uniform 0;
        value           uniform 0;
    }
    south
    {
        type            solarLoadRadiationViewFactor;
        albedoMode      lookup;
        albedo          uniform 0;
        qso             uniform 0;
        value           uniform 0;
    }
    buildings
    {
        type            solarLoadRadiationViewFactor;
        albedoMode      lookup;
        albedo          uniform 0.4;
        qso             uniform 0;
        value           uniform 0;
    }
    air_to_vegetation
    {
        type            solarLoadRadiationViewFactor;
        albedoMode      lookup;
        albedo          uniform 0.15;
        qso             uniform 0;
        value           uniform 0;
    }
}


// ************************************************************************* //
