windAroundBuildings_CFDHAM_veg/constant/Idif
(
(	0	0	)
(	3600	0	)
(	7200	0	)
(	10800	0	)
(	14400	0	)
(	18000	0	)
(	21600	0	)
(	25200	34	)
(	28800	63	)
(	32400	151	)
(	36000	303	)
(	39600	335	)
(	43200	277	)
(	46800	144	)
(	50400	471	)
(	54000	232	)
(	57600	242	)
(	61200	91	)
(	64800	75	)
(	68400	50	)
(	72000	0	)
(	75600	0	)
(	79200	0	)
(	82800	0	)
(	86400	0	)
)
