windAroundBuildings_CFDHAM_veg/constant/air/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     0.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/air/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


7
(
    west
    {
        type            patch;
        nFaces          530;
        startFace       4936992;
    }

    east
    {
        type            patch;
        nFaces          530;
        startFace       4937522;
    }

    north
    {
        type            patch;
        nFaces          870;
        startFace       4938052;
    }

    south
    {
        type            patch;
        nFaces          870;
        startFace       4938922;
    }

    ground
    {
        type            wall;
        inGroups        List<word> 0();
        nFaces          59451;
        startFace       4939792;
    }

    top
    {
        type            patch;
        nFaces          4611;
        startFace       4999243;
    }

    buildings
    {
        type            mappedWall;
        inGroups        List<word> 0();
        nFaces          269170;
        startFace       5003854;
        sampleMode      nearestPatchFace;
        sampleRegion    buildings;
        samplePatch     buildings_to_air;
        offsetMode      uniform;
        offset          ( 0 0 0 );
    }

)


// ************************************************************************* //
